Tekla Open API Reference for Tekla Structures 2025
Dialogs Class
 The Dialogs class contains interface methods for Tekla Structures to handle FormBase and WindowBase dialogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 Tekla.Structures.Dialog.Dialogs
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Dialogs : MarshalByRefObject
Public Class Dialogs
	Inherits MarshalByRefObject
The Dialogs type exposes the following members.
Constructors
Name | Description
Dialogs
Initializes a new instance of the Dialogs class
Top
Methods
Name | Description
ClosePluginDialogs
 Close all dialogs to end the threads running the corresponding message loops.
GetPluginFormBaseByPluginFormName
 Retrieves an instance of the form.
GetPluginWindowBaseByPluginFormName
 Retrieves an instance of the form.
LoadAttributeFileNameToDialogAndApply(String)
 Uses the attributes found from the attribute file as the applied values for the specified dialog.
LoadAttributeFileNameToDialogAndApply(String, String)
 Loads the specified dialog's applied values from the attribute file.
LoadAttributeFileNameToDialogAndModify(String)
 Uses the attributes found from the attribute file as the current values for the specified dialog. Modifies the current selected instance. Applied values for this dialog are not changed.
LoadAttributeFileNameToDialogAndModify(String, String)
 Loads the specified dialog's current values from the attribute file and modifies the current selected instance.
LoadAttributeFileNameToDialogAndSave
 Uses the attributes found from the attribute file for the specified dialog and saves to file.
LoadAttributeFileToStack
 Opens a dialog and forces it to get the values from the currently selected part.
LoadDialogs
 Reads the PluginFormBase and PluginWindowBase dialogs from all found dll files in bin\dialogs and bin\plugins.
OpenDialog
 Opens a dialog. The name of the dialog is asked from the Tekla Structures core.
OpenDialogAndGet
 Opens a dialog and forces it to get the values from the currently selected part.
ReloadDialogs
 Reloads all PluginFormBase dialogs with default/standard values.
SetSettings
 Forces the dialog system to get the language and localization settings from Tekla Structures.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace